# 4. Напишите программу, которая на вход принимает вещественное число и показывает первую цифру после запятой.

n = float(input())
print (int(n*10%10))