# 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# *Пример:*

# - 6 -> да
# - 7 -> да
# - 1 -> нет


n = int(input())
m = int(input())

if n == m ** 2 or m == n ** 2:
	    print("Yes")
else:
	    print("No")
